In [1]:
import pandas as pd

In [2]:
d = {'col1': [1, 2, 3, 4, 5],
    'col2': [10, 20, 30, 40, 50]}

df = pd.DataFrame(d)
df

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

# Random sampling with/without replacement

In [3]:
df.sample(n=3, replace=False, random_state=0)

   col1  col2
2     3    30
0     1    10
1     2    20

In [4]:
df.sample(n=4, replace=True, random_state=0)

   col1  col2
4     5    50
0     1    10
3     4    40
3     4    40

In [5]:
df.sample(n=4, replace=False, random_state=1)

   col1  col2
2     3    30
1     2    20
4     5    50
0     1    10

In [6]:
df.sample(n=4, replace=True, random_state=10) # fungsi random_state = untuk menjamin suatu eksperimen itu bisa dilakukan replikasi atau bisa dilakukan ulang dengan hasil yang sama persis

   col1  col2
1     2    20
4     5    50
0     1    10
1     2    20

In [7]:
df.sample(n=4, replace=False, random_state=0)

   col1  col2
2     3    30
0     1    10
1     2    20
3     4    40